<template>
    <h1>说明</h1>
    <p>这是一个用vue3建立起来的小网页，主要功能是利用API与AI进行对话（API的请求格式参考阿里云，不同服务商或许要求不同），下面介绍下一些功能：</p>
    <hr><br>
    <h2>聊天区</h2>
    <p>在聊天区中，你可以在下面的输入框输入内容，完成后发送。此时发送按钮会变成一个加载动画，AI返回信息的方式是非流式响应，所以没有提供响应中断的功能。支持多轮对话，每次发送都会把之前的信息发送给模型（错误信息和因错误未响应的信息除外）<br><br>
    在聊天区的右上角，可以选择导出聊天记录，相应的内容会按照一定的形式以html文件的形式导出。建议在浏览器中开启文件下载前进行询问（浏览器设置->下载），把所有的导出文件下载至同一文件夹以供查找<br><br>
    此外，你也可以选择重新开启一个对话，但是此操作不会自动导出当前内容，同时会有一个警告信息需要确认<br><br>
    如果出现错误信息，可先去设置中保存一次再进行对话</p>
    <hr><br>
    <h2>历史对话区</h2>
    <p>在历史对话区中，你可以查看之前的对话记录，点击对应的记录可以查看详细内容。需要手动选择之前导出的html文件，一次可选多个，这也是建议保存同一位置的原因。右侧显示的内容仅包含html和css内容，JavaScript的相应功能已被去除。
    </p>
    <hr><br>
    <h2>设置</h2>
    <p>在设置中，你可以配置调用模型的端口（网页采用纯前端的方式进行访问）、API密钥、模型名称。比如阿里云的千问系列模型。此处填写的信息保存后都会在异步请求中使用，请注意内容准确无误。</p>
    <hr><br>
    <h2>最后</h2>
    <p>整个vue项目创立于2024年11月12日23:03:59，在2024年11月16日16:40编写说明进行收尾工作。感谢GPT4o、Claude 3.5、o1 preview的大力支持，让我在要上课要写作业的三天多里完成了这个小项目。整个项目都是我自己构思的，其实存在一些bug和功能的不足，比如说代码块没法直接复制、配色不是很高级等，之后有机会再改。顺带吐槽，AI在框架里面真的会很呆，局部功能实现的不错，但是一到整体，尤其是不同文件之间的关系就很容易宕机，css也还是需要自己写的，期待未来专门思考代码框架涉及的模型。<br><br>
    为什么要写中英两个说明呢？哈，我只是想要练习下嵌套路由，所以就写了两个说明，中英文的内容是一样的，只是语言不同而已。
    </p>
</template>

<style scoped>
    h1 {
        font-size: 2em;
        color: #333;
        text-align: center;
    }
    h2 {
        text-align: left;
        padding: 5px 10px;
        font-size: 1.5em;
        color: #333;
    }
    p {
        font-size: 1em;
        color: #333;
        padding: 5px 10px;
        text-align: left;
    }
    hr {
        width: 100%;
        border: 1px solid #333;
    }
    br {
        margin: 10px 0;
    }
</style>